cmsis-svd/cmsis-svd/data/Atmel/ATSAMS70N19.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>GPBR</name>
         <version>6378H</version>
         <description>General Purpose Backup Registers</description>
         <groupName>GPBR</groupName>
         <prependToName>GPBR_</prependToName>
         <baseAddress>0x400E1890</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x20</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <dim>8</dim>
               <dimIncrement>4</dimIncrement>
               <name>SYS_GPBR[%s]</name>
               <description>General Purpose Backup Register 0</description>
               <addressOffset>0x0</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>GPBR_VALUE</name>
                     <description>Value of GPBR x</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
      <peripheral>
         <name>HSMCI</name>
         <version>6449Q</version>
         <description>High Speed MultiMedia Card Interface</description>
         <groupName>HSMCI</groupName>
         <prependToName>HSMCI_</prependToName>
         <baseAddress>0x40000000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0xB58</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>HSMCI</name>
            <value>18</value>
         </interrupt>
         <registers>
            <register>
               <name>HSMCI_CR</name>
               <description>Control Register</description>
               <addressOffset>0x00</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>MCIEN</name>
                     <description>Multi-Media Interface Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MCIDIS</name>
                     <description>Multi-Media Interface Disable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PWSEN</name>
                     <description>Power Save Mode Enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PWSDIS</name>
                     <description>Power Save Mode Disable</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWRST</name>
                     <description>Software Reset</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HSMCI_MR</name>
               <description>Mode Register</description>
               <addressOffset>0x04</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>CLKDIV</name>
                     <description>Clock Divider</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>PWSDIV</name>
                     <description>Power Saving Divider</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>RDPROOF</name>
                     <description>Read Proof Enable</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WRPROOF</name>
                     <description>Write Proof Enable</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FBYTE</name>
                     <description>Force Byte Transfer</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PADV</name>
                     <description>Padding Value</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CLKODD</name>
                     <description>Clock divider is odd</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HSMCI_DTOR</name>
               <description>Data Timeout Register</description>
               <addressOffset>0x08</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>DTOCYC</name>
                     <description>Data Timeout Cycle Number</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>DTOMUL</name>
                     <description>Data Timeout Multiplier</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>DTOMULSelect</name>
                        <enumeratedValue>
                           <name>_1</name>
                           <description>DTOCYC</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_16</name>
                           <description>DTOCYC x 16</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_128</name>
                           <description>DTOCYC x 128</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_256</name>
                           <description>DTOCYC x 256</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_1024</name>
                           <description>DTOCYC x 1024</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_4096</name>
                           <description>DTOCYC x 4096</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_65536</name>
                           <description>DTOCYC x 65536</description>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_1048576</name>
                           <description>DTOCYC x 1048576</description>
                           <value>0x7</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>HSMCI_SDCR</name>
               <description>SD/SDIO Card Register</description>
               <addressOffset>0x0C</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>SDCSEL</name>
                     <description>SDCard/SDIO Slot</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>SDCSELSelect</name>
                        <enumeratedValue>
                           <name>SLOTA</name>
                           <description>Slot A is selected.</description>
                           <value>0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SDCBUS</name>
                     <description>SDCard/SDIO Bus Width</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>SDCBUSSelect</name>
                        <enumeratedValue>
                           <name>_1</name>
                           <description>1 bit</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_4</name>
                           <description>4 bits</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_8</name>
                           <description>8 bits</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>HSMCI_ARGR</name>
               <description>Argument Register</description>
               <addressOffset>0x10</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>ARG</name>
                     <description>Command Argument</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HSMCI_CMDR</name>
               <description>Command Register</description>
               <addressOffset>0x14</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>CMDNB</name>
                     <description>Command Number</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>RSPTYP</name>
                     <description>Response Type</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>RSPTYPSelect</name>
                        <enumeratedValue>
                           <name>NORESP</name>
                           <description>No response</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_48_BIT</name>
                           <description>48-bit response</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_136_BIT</name>
                           <description>136-bit response</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>R1B</name>
                           <description>R1b response type</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SPCMD</name>
                     <description>Special Command</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>SPCMDSelect</name>
                        <enumeratedValue>
                           <name>STD</name>
                           <description>Not a special CMD.</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>INIT</name>
                           <description>Initialization CMD: 74 clock cycles for initialization sequence.</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SYNC</name>
                           <description>Synchronized CMD: Wait for the end of the current data block transfer before sending the pending command.</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CE_ATA</name>
                           <description>CE-ATA Completion Signal disable Command. The host cancels the ability for the device to return a command completion signal on the command line.</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>IT_CMD</name>
                           <description>Interrupt command: Corresponds to the Interrupt Mode (CMD40).</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>IT_RESP</name>
                           <description>Interrupt response: Corresponds to the Interrupt Mode (CMD40).</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>BOR</name>
                           <description>Boot Operation Request. Start a boot operation mode, the host processor can read boot data from the MMC device directly.</description>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EBO</name>
                           <description>End Boot Operation. This command allows the host processor to terminate the boot operation mode.</description>
                           <value>0x7</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>OPDCMD</name>
                     <description>Open Drain Command</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>OPDCMDSelect</name>
                        <enumeratedValue>
                           <name>PUSHPULL</name>
                           <description>Push pull command.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>OPENDRAIN</name>
                           <description>Open drain command.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>MAXLAT</name>
                     <description>Max Latency for Command to Response</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>MAXLATSelect</name>
                        <enumeratedValue>
                           <name>_5</name>
                           <description>5-cycle max latency.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_64</name>
                           <description>64-cycle max latency.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TRCMD</name>
                     <description>Transfer Command</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>TRCMDSelect</name>
                        <enumeratedValue>
                           <name>NO_DATA</name>
                           <description>No data transfer</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>START_DATA</name>
                           <description>Start data transfer</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>STOP_DATA</name>
                           <description>Stop data transfer</description>
                           <value>0x2</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TRDIR</name>
                     <description>Transfer Direction</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>TRDIRSelect</name>
                        <enumeratedValue>
                           <name>WRITE</name>
                           <description>Write.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>READ</name>
                           <description>Read.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TRTYP</name>
                     <description>Transfer Type</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>TRTYPSelect</name>
                        <enumeratedValue>
                           <name>SINGLE</name>
                           <description>MMC/SD Card Single Block</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>MULTIPLE</name>
                           <description>MMC/SD Card Multiple Block</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>STREAM</name>
                           <description>MMC Stream</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>BYTE</name>
                           <description>SDIO Byte</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>BLOCK</name>
                           <description>SDIO Block</description>
                           <value>0x5</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>IOSPCMD</name>
                     <description>SDIO Special Command</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>IOSPCMDSelect</name>
                        <enumeratedValue>
                           <name>STD</name>
                           <description>Not an SDIO Special Command</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SUSPEND</name>
                           <description>SDIO Suspend Command</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RESUME</name>
                           <description>SDIO Resume Command</description>
                           <value>0x2</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ATACS</name>
                     <description>ATA with Command Completion Signal</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>ATACSSelect</name>
                        <enumeratedValue>
                           <name>NORMAL</name>
                           <description>Normal operation mode.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>COMPLETION</name>
                           <description>This bit indicates that a completion signal is expected within a programmed amount of time (HSMCI_CSTOR).</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>BOOT_ACK</name>
                     <description>Boot Operation Acknowledge</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
